package by.htp.les01.main;

//Даны два действительных числа х и у. 
//Вычислить их сумму, разность, произведение и частное.

public class Task01 {

	public static void main(String[] args) {

		int x = 20;
		int y = 4;

		int z1 = x + y;
		int z2 = x - y;
		int z3 = x * y;
		int z4 = x / y;

		System.out.println("сумма = " + z1);
		System.out.println("разность = " + z2);
		System.out.println("произведение = " + z3);
		System.out.println("частное = " + z4);

	}

}
