package by.htp.les01.main;

//Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника

public class Task07 {

	public static void main(String[] args) {

		int a = 2;

		int s = a * (a * 2);

		System.out.println(s);
	}

}
