package by.htp.les01.main;

//Вычислить значение выражения по формуле (все переменные принимают действительные значения)

public class Task09 {

	public static void main(String[] args) {

		int a = 10;
		int b = 3;
		int c = 2;
		int d = 6;

		double x;
		x = (a / c) * (b / d) - ((a * b - c) / (c * d));

		System.out.println(x);

	}

}
