package by.htp.les03.main;

// Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру 7, в противном случае
//– цифру 8.

public class Task01 {
	public static void main(String[] args) {

		if (1 < 2) {
			System.out.println("7");
		}

		else if (2 < 1) {
			System.out.println("8");
		}
	}

}
